{
  "header": {
    "churchName": "IPC Hebron",
    "location": "Neria, Karnataka"
  },
  "pageTitles": {
    "about": "About Us",
    "ourStory": "Our Story",
    "ministries": "Our Ministries",
    "events": "Events Calendar",
    "services": "Service Times",
    "counseling": "Prayer Request",
    "gallery": "Photo Gallery",
    "contact": "Contact Us",
    "sermons": "Sermon Archive",
    "giving": "Online Giving"
  },
  "nav": {
    "home": "HOME",
    "about": "ABOUT US",
    "aboutUs": "About Us",
    "ourStory": "Our Story",
    "statementOfFaith": "Statement of Faith",
    "ministries": "Ministries",
    "events": "EVENTS",
    "services": "SERVICES",
    "counseling": "COUNSELING",
    "gallery": "GALLERY",
    "contact": "CONTACT US"
  },
  "home": {
    "heroWelcome": "WELCOME TO",
    "heroTitle": "IPC Hebron Neria",
    "heroSubtitle": "Neria, Karnataka",
    "heroCTA": "Contact Us",
    "welcome": "Welcome to IPC Hebron",
    "mission": "Our mission is to glorify God by proclaiming the Gospel of Jesus Christ, being led by the Holy Spirit, making disciples, and demonstrating God's love through worship, word, and works.",
    "serviceTimes": "Service Times",
    "learnMore": "Learn More",
    "serviceSchedule": "Service Schedule",
    "sundayService": "Sunday Service",
    "wednesday": "Wednesday",
    "friday": "Friday",
    "cottageMeeting": "Cottage Meeting",
    "fastingPrayer": "Fasting Prayer",
    "getInvolved": "Get Involved",
    "sermons": "Sermons",
    "listenMessages": "Listen to our latest messages",
    "events": "Events",
    "upcomingEvents": "Upcoming church events",
    "prayer": "Prayer",
    "submitPrayer": "Submit a prayer request",
    "gallery": "Gallery",
    "viewGallery": "View our photo gallery"
  },
  "about": {
    "title": "About IPC Hebron",
    "subtitle": "Neria, Belthangady TQ, D.K, Karnataka, India",
    "mission": "Our Mission",
    "missionText": "Our mission is to glorify God by proclaiming the Gospel of Jesus Christ, being led by the Holy Spirit, making disciples, and demonstrating God's love through worship, word, and works.",
    "whoWeAre": "Who We Are",
    "whoWeAreText1": "India Pentecostal Church Hebron (IPC Hebron) is a vibrant Pentecostal congregation located in Neria, Belthangady Taluk, Dakshina Kannada, Karnataka, India. We are a community of believers committed to following Jesus Christ and spreading His message of love, hope, and salvation.",
    "whoWeAreText2": "As a Pentecostal church, we believe in the power and presence of the Holy Spirit in our lives and worship. We emphasize the importance of prayer, worship, and the study of God's Word as foundational to our faith journey.",
    "leadership": "Our Leadership",
    "history": "Our History",
    "historyText": "IPC Hebron was blessed and started in 1990. We honor the faithful pastors who have served our congregation throughout the years.",
    "governingBody": "Current Governing Body",
    "coreValues": "Our Core Values",
    "wordOfGod": "Word of God",
    "wordOfGodText": "We believe the Bible is the inspired Word of God and the foundation for our faith and practice.",
    "loveCommunity": "Love & Community",
    "loveCommunityText": "We demonstrate God's love through our relationships and service to one another and our community.",
    "discipleship": "Discipleship",
    "discipleshipText": "We are committed to making disciples who follow Jesus and share His message with others.",
    "pentecostalFaith": "Pentecostal Faith",
    "pentecostalFaithText": "As a Pentecostal church, we embrace the full work of the Holy Spirit in the life of the believer. We believe in:",
    "pentecostalBeliefs": [
      "The baptism of the Holy Spirit with the evidence of speaking in tongues",
      "The gifts of the Spirit for the edification of the church",
      "Divine healing and miracles through faith in Jesus Christ",
      "The importance of prayer and intercession",
      "Worship that is vibrant, Spirit-led, and heartfelt"
    ]
  },
  "services": {
    "title": "Service Times",
    "subtitle": "Join us for worship and fellowship",
    "sundayService": "Sunday Service",
    "sundayTime": "10:00 AM - 12:30 PM",
    "sundayDesc": "Join us for our main worship service featuring praise and worship, prayer, and a message from God's Word. This is a time of fellowship, learning, and growing together in faith.",
    "wednesday": "Wednesday",
    "wednesdayTitle": "Cottage Meeting",
    "wednesdayDesc": "Small group gatherings in homes for Bible study, prayer, and fellowship. These intimate meetings provide an opportunity for deeper connection and spiritual growth.",
    "friday": "Friday",
    "fridayTitle": "Fasting Prayer",
    "fridayDesc": "A dedicated time of fasting and prayer where we seek God's face, intercede for our community, and experience the power of corporate prayer.",
    "location": "Location",
    "whatToExpect": "What to Expect",
    "worship": "Worship",
    "worshipText": "Experience vibrant, Spirit-led worship with contemporary and traditional songs that honor God and invite His presence.",
    "teaching": "Teaching",
    "teachingText": "Receive practical, Bible-based teaching that applies God's Word to everyday life and helps you grow in your faith.",
    "fellowship": "Fellowship",
    "fellowshipText": "Connect with other believers in a warm, welcoming environment where everyone is valued and accepted.",
    "prayer": "Prayer",
    "prayerText": "Join in corporate prayer and receive personal prayer ministry from our prayer team."
  },
  "events": {
    "title": "Events Calendar",
    "subtitle": "Join us for upcoming events and activities"
  },
  "gallery": {
    "title": "Photo Gallery",
    "subtitle": "Capturing moments of faith, fellowship, and worship",
    "allPhotos": "All Photos",
    "services": "Services",
    "events": "Events",
    "youth": "Youth",
    "prayer": "Prayer",
    "outreach": "Outreach",
    "noImages": "No images found in this category."
  },
  "contact": {
    "title": "Contact Us",
    "subtitle": "We'd love to hear from you",
    "getInTouch": "Get in Touch",
    "getInTouchText": "We're here to help and answer any questions you may have. Feel free to reach out to us through any of the following ways.",
    "address": "Address",
    "phone": "Phone",
    "email": "Email",
    "serviceTimes": "Service Times",
    "followUs": "Follow Us",
    "socialMediaComing": "Social media links will be added soon",
    "sendMessage": "Send us a Message",
    "fullName": "Full Name",
    "required": "*",
    "namePlaceholder": "Your name",
    "emailPlaceholder": "your.email@example.com",
    "phonePlaceholder": "Your phone number",
    "subject": "Subject",
    "subjectPlaceholder": "What is this regarding?",
    "message": "Message",
    "messagePlaceholder": "Your message...",
    "send": "Send Message",
    "messageSent": "Message Sent!",
    "thankYou": "Thank you for contacting us. We'll get back to you as soon as possible.",
    "findUs": "Find Us",
    "visitUs": "Visit us at our location"
  },
  "prayer": {
    "title": "Prayer Request",
    "subtitle": "We're here to pray with you",
    "prayerText": "We believe in the power of prayer. Please share your prayer request with us, and our prayer team will intercede on your behalf. All requests are kept confidential and handled with care.",
    "name": "Name",
    "email": "Email",
    "phone": "Phone",
    "prayerRequest": "Prayer Request",
    "prayerRequestPlaceholder": "Please share your prayer request...",
    "submitAnonymously": "Submit anonymously",
    "submit": "Submit Prayer Request",
    "thankYou": "Thank You!",
    "received": "Your prayer request has been received. Our prayer team will be lifting you up in prayer.",
    "aboutPrayer": "About Our Prayer Ministry",
    "prayerMinistryText1": "Our prayer team is committed to interceding for every request we receive. We believe that prayer changes things and that God hears and answers the prayers of His people.",
    "prayerMinistryText2": "Note: In production, prayer requests would be sent to a secure backend system and can be managed through an admin panel. You may want to integrate with email services or a database to store and manage requests."
  },
  "giving": {
    "title": "Online Giving",
    "subtitle": "Support our ministry and make a difference",
    "whyWeGive": "Why We Give",
    "whyWeGiveText1": "Each of you should give what you have decided in your heart to give, not reluctantly or under compulsion, for God loves a cheerful giver. - 2 Corinthians 9:7",
    "whyWeGiveText2": "Your generous giving helps us continue our mission of spreading the Gospel, supporting our community, and maintaining our church facilities. Every contribution, no matter the size, makes a difference in advancing God's kingdom.",
    "makeDonation": "Make a Donation",
    "donationAmount": "Donation Amount",
    "paymentMethod": "Payment Method",
    "upi": "UPI",
    "card": "Card",
    "bankTransfer": "Bank Transfer",
    "donorInfo": "Donor Information",
    "recurring": "Make this a recurring donation",
    "messageOptional": "Message (Optional)",
    "proceedPayment": "Proceed to Payment",
    "thankYou": "Thank You!",
    "donationReceived": "Your donation has been received. We appreciate your generous support of our ministry.",
    "bankDetails": "Bank Transfer Details",
    "accountName": "Account Name",
    "accountNumber": "Account Number",
    "ifscCode": "IFSC Code",
    "bankName": "Bank Name",
    "branch": "Branch",
    "bankNote": "For bank transfer, please include your name and phone number in the transaction remarks. After transfer, email us at ipchebronneria@gmail.com with the transaction details for receipt."
  },
  "sermons": {
    "title": "Sermon Archive",
    "subtitle": "Listen to messages from our services"
  },
  "ministries": {
    "title": "Our Ministries",
    "subtitle": "Discover opportunities to grow, serve, and make a difference in our church and community",
    "getInvolved": "Get Involved",
    "getInvolvedText": "There's a place for everyone in our church family. Whether you're interested in youth ministry, children's programs, worship, or outreach, we'd love to help you find your place to serve.",
    "contactUs": "Contact Us",
    "viewEvents": "View Events",
    "whyWeServe": "Why We Serve",
    "whyWeServeText": "Our ministries are built on biblical principles and a heart for service",
    "purpose": "Purpose",
    "purposeText": "Every ministry has a clear purpose aligned with God's Word and our mission",
    "passion": "Passion",
    "passionText": "We serve with passion, dedication, and a heart to see lives transformed",
    "people": "People",
    "peopleText": "Our ministries are about people - loving, serving, and building relationships"
  },
  "dailyVerse": {
    "title": "Daily Bible Verse"
  },
  "footer": {
    "copyright": "IPC Hebron, Neria © {{year}} All Rights Reserved.",
    "quickLinks": "Quick Links",
    "contactInfo": "Contact Information",
    "serviceTimes": "Service Times",
    "madeWith": "Made with",
    "forGod": "for the glory of God"
  },
  "statementOfFaith": {
    "title": "Statement of Faith",
    "subtitle": "Our foundational beliefs based on the Word of God",
    "triuneGod": {
      "title": "The Triune God",
      "content": "We believe in one living and true God, eternally existing as Father, Son, and Holy Spirit—equal in power and glory. God created all things and continues to sustain and rule over all creation.",
      "verses": "Deuteronomy 6:4; Matthew 28:19; Colossians 1:16–17"
    },
    "godFather": {
      "title": "God the Father",
      "content": "We believe God the Father is eternal, all-knowing, ever-present, and all-powerful. He is holy and righteous, and His love was revealed through the sacrifice of His Son, Jesus Christ.",
      "verses": "Psalm 90:2; Isaiah 6:3; John 3:16; Romans 5:8"
    },
    "jesusChrist": {
      "title": "Jesus Christ",
      "content": "We believe in Jesus Christ, the Son of God—His virgin birth, sinless life, miracles, death for our sins, bodily resurrection, ascension to heaven, and His glorious return.",
      "verses": "Isaiah 7:14; Hebrews 4:15; 1 Corinthians 15:3–4; Acts 1:9–11"
    },
    "holyScriptures": {
      "title": "The Holy Scriptures",
      "content": "We believe the Bible, both Old and New Testaments, is the inspired Word of God and the final authority for faith and Christian living.",
      "verses": "2 Timothy 3:16–17; 2 Peter 1:20–21"
    },
    "holySpirit": {
      "title": "The Holy Spirit",
      "content": "We believe in the Holy Spirit, who convicts the world of sin, brings new life, sanctifies believers, and empowers them for godly living and ministry.",
      "verses": "John 16:8; Titus 3:5; Acts 1:8"
    },
    "giftsBaptism": {
      "title": "Gifts and Baptism of the Holy Spirit",
      "content": "We believe in the present work of the Holy Spirit and the operation of spiritual gifts. These gifts are to be used in love, unity, and order. We believe Jesus baptizes believers with the Holy Spirit for empowered service.",
      "verses": "1 Corinthians 12:4–11; 1 Corinthians 14:40; Acts 2:4"
    },
    "salvation": {
      "title": "Salvation",
      "content": "We believe salvation is a gift of God, received by grace through faith in Jesus Christ—not by human works—and results in a transformed life.",
      "verses": "Ephesians 2:8–10; Romans 3:28"
    },
    "sinNewBirth": {
      "title": "Sin and New Birth",
      "content": "We believe all people are sinners and need salvation. Those who repent and confess Jesus Christ are born again by the Holy Spirit.",
      "verses": "Romans 3:23; John 3:3; Romans 10:9–10"
    },
    "layingOnHands": {
      "title": "Laying on of Hands",
      "content": "We believe in the laying on of hands for the baptism of the Holy Spirit, ordination into ministry, and healing through the power of God.",
      "verses": "Acts 8:17; Acts 13:3; Mark 16:18"
    },
    "church": {
      "title": "The Church",
      "content": "We believe in one universal Church, the Body of Christ, made up of all believers, with Jesus Christ as its head.",
      "verses": "Ephesians 1:22–23; 1 Corinthians 12:12–13"
    },
    "ordinances": {
      "title": "Church Ordinances",
      "content": "We believe Jesus Christ established two ordinances for the Church: water baptism by immersion and the Lord's Supper.",
      "verses": "Matthew 28:19; Romans 6:4; Luke 22:19–20"
    },
    "sanctification": {
      "title": "Sanctification",
      "content": "We believe sanctification is the ongoing work of God that sets believers apart from sin and dedicates them to holy living.",
      "verses": "1 Thessalonians 4:3; Romans 12:1–2"
    },
    "lastThings": {
      "title": "Last Things",
      "content": "We believe in the rapture of the Church, the visible return of Jesus Christ, the resurrection of the dead, final judgment, eternal life for the righteous, and eternal separation for the wicked.",
      "verses": "1 Thessalonians 4:16–17; Revelation 20:11–15; Revelation 21:1–4"
    }
  },
  "testimonials": {
    "title": "Testimonials",
    "subtitle": "Hear from our church family about how God is working in their lives",
    "testimonial1": {
      "name": "Srini Sham",
      "text": "Really blessed to be part of the church family where focus is on Jesus. God has anointed and transformed my life. The word of God shared here enriches me. Glad to be here. Praise God."
    },
    "testimonial2": {
      "name": "Sarah Johnson",
      "text": "IPC Hebron has been a blessing in my life. The worship services are powerful, and the teaching of God's word has helped me grow spiritually. I'm grateful for this church family."
    },
    "testimonial3": {
      "name": "David Kumar",
      "text": "The love and fellowship I've experienced here is amazing. The prayers and support from the church community have been instrumental in my spiritual journey. Thank you, IPC Hebron!"
    },
    "testimonial4": {
      "name": "Priya Menon",
      "text": "Being part of IPC Hebron has transformed my relationship with God. The Holy Spirit moves powerfully here, and I've seen God's faithfulness in every area of my life."
    },
    "testimonial5": {
      "name": "Michael Thomas",
      "text": "This church is truly a place where God's presence is felt. The ministry, worship, and fellowship have been life-changing. I'm blessed to call IPC Hebron my home church."
    }
  },
  "whatsapp": {
    "contactName": "IPC Hebron",
    "replyTime": "Typically replies within an hour",
    "welcomeMessage": "Hi there 👋",
    "helpMessage": "How can I help you?",
    "startChat": "Start Chat"
  },
  "ourStory": {
    "title": "Our Story",
    "subtitle": "A journey of faith, dedication, and God's faithfulness since 1990",
    "beginning": {
      "title": "The Beginning",
      "paragraph1": "IPC Hebron Neria was blessed and established in the year 1990, founded by the visionary leadership of Pr K P Babu.",
      "paragraph2": "With a heart for God and a passion for ministry, Pr K P Babu laid the cornerstone of our church, creating a place where the Gospel could be proclaimed and lives transformed.",
      "paragraph3": "From humble beginnings, our church has grown into a vibrant community of believers, dedicated to serving God and reaching out to our neighbors with the love of Christ.",
      "paragraph4": "Through the years, we have remained committed to our mission of making disciples, building community, and advancing God's kingdom in Neria and beyond."
    },
    "history": {
      "title": "Our History",
      "description": "IPC Hebron was blessed and started in 1990. We honor the faithful pastors who have served our congregation throughout the years."
    },
    "badges": {
      "founder": "Founder",
      "current": "Current"
    },
    "pastors": {
      "kPBabu": {
        "name": "Pr K P Babu",
        "tenure": "1990 - 1997",
        "years": "7 years",
        "description": "Pr K P Babu was the founding pastor who established IPC Hebron in 1990. His vision and dedication laid the foundation for our church, and his faithful service for 7 years set the course for our ministry."
      },
      "pPDaniel": {
        "name": "Pr P P Daniel",
        "tenure": "1997 - 2001",
        "years": "4 years",
        "description": "Pr P P Daniel served our church with great commitment for 4 years. His leadership strengthened our congregation and continued the work of building a strong foundation in faith and community."
      },
      "rajuKJ": {
        "name": "Pr Raju KJ",
        "tenure": "2001 - 2006",
        "years": "5 years",
        "description": "Pr Raju KJ led our church for 5 years with wisdom and grace. During his tenure, the church experienced significant growth in membership and expanded its ministry outreach to the community."
      },
      "rajuCS": {
        "name": "Pr Raju CS",
        "tenure": "2006 - 2009",
        "years": "3 years",
        "description": "Pr Raju CS served our congregation for 3 years with passion and dedication. His teaching ministry and pastoral care blessed many families and strengthened the spiritual foundation of our church."
      },
      "josePaul": {
        "name": "Pr Jose Paul",
        "tenure": "2009 - 2012",
        "years": "3 years",
        "description": "Pr Jose Paul ministered to our church for 3 years with faithfulness and love. His emphasis on prayer and worship brought renewal to our congregation and deepened our relationship with God."
      },
      "matthai": {
        "name": "Pr Matthai",
        "tenure": "2012 - 2016",
        "years": "4 years",
        "description": "Pr Matthai served our church with dedication and commitment for 4 years. His leadership brought stability and growth to our congregation, strengthening our faith and community bonds."
      },
      "aby": {
        "name": "Pr Aby",
        "tenure": "2016 - 2021",
        "years": "5 years",
        "description": "Pr Aby served our church for 5 years with great commitment. His leadership focused on discipleship and community building, leaving a lasting impact on the spiritual growth of our members."
      },
      "roy": {
        "name": "Pr Roy",
        "tenure": "2021 - 2023",
        "years": "2 years",
        "description": "Pr Roy led our congregation for 2 years with wisdom and compassion. His ministry emphasized evangelism and outreach, bringing many new souls to Christ and expanding our church's impact in the community."
      },
      "suresh": {
        "name": "Pr Suresh",
        "tenure": "2023 - Present",
        "years": "Currently Serving",
        "description": "Pr Suresh is currently serving as our Senior Pastor, leading the congregation with vision and dedication. Under his leadership, the church continues to grow in faith, impact, and service to God and the community."
      }
    }
  },
  "common": {
    "loading": "Loading...",
    "error": "Error",
    "close": "Close",
    "next": "Next",
    "previous": "Previous"
  }
}
